from utils.text_utils import format_message


msg = """*СЛР з дефібрилятором:*
 
🔺 Визначити свідомість;
🔺 Визначити  дихання, пульс на шиї; 

❗️*Необхідно надати допомогу при* \(хоча б один пункт\):

🔹Відсутності свідомості
🔹Відсутності дихання 
🔹Відсутності пульсу

🔺 Викликати бригаду медиків

🔻  Почати проведення СЛР
▪️ Виконати *30 натискань на центр грудної клітки \(нижню половину грудини\) глибиною 5\-6 см з частотою 100\-120 разів на хвилину*\, даючи грудній клітці можливість повернутися у вихідне положення після кожного натискання;
▪️ При наявності маски\-клапану або мішка Амбу виконати *2 штучних вдихи* до піднімання грудної клітки тривалістю *до 5 секунд*;

*ПРИ ВІДСУТНОСТІ МАСКИ\-КЛАПАНУ ПРОДОВЖУВАТИ БЕЗПЕРЕРВНІ НАТИСКАННЯ БЕЗ ВДИХАНЬ*

❗️Продовжити натискання і вдихи у співвідношенні 30\:2 \- *перерва не більше 10 сек*❗️

‼️Змінювати особу, що проводить натискання на грудну клітку, *кожні 2 хвилини \(5 циклів\)*‼️

🔻  Після початку проведення СЛР принести дефібрилятор
🔻  *Відкрити кришку дефібрилятора* 
\(якщо він не ввімкнувся автоматично \- увімкніть його\!\)
🔻  Виконуйте *ГОЛОСОВІ КОМАНДИ* дефібрилятора
🔻  *ПРИКЛЕЙТЕ* електроди на грудну клітку так, як рекомендують‼️
🔻  *ЗАЧЕКАЙТЕ* поки дефібрилятор проаналізує серцевий ритм
‼️Під час цього *НЕ МОЖНА* торкатись постраждалого‼️
   
🔻  Якщо дефібриляція *ПОКАЗАНА*➡️натисніть на кнопку *РОЗРЯД*
‼️Під час цього *НЕ МОЖНА* торкатись постраждалого‼️

🔻  Після дефібриляції *ПРОДОВЖУЄМО СЛР* 
\(30 натискань на центр грудної клітки з частотою 120 разів на хвилину\)

🔻  Дотримуватись голосових рекомендацій дефібрилятора під час проведення СЛР
🔻  *ПРИ ВІДНОВЛЕННІ ОЗНАК ЖИТТЯ* \- забезпечити постійний нагляд до приїзду ЕМД 
‼️Електроди залишити на грудній клітці
  
🔻  *ПРИ ПОВТОРНІЙ ЗУПИНЦІ СЕРЦЯ* до приїзду бригади медиків \- повторити СЛР та дії з дефібрилятором\!"""


msg2 = """🔻  Почати проведення СЛР
• два пальці в центрі грудної клітки__обережно притримувати голову дитини__
• Виконати __30 натискань__ на центр грудної клітки з частотою __120 разів на хвилину__, даючи грудній клітці можливість повернутися у вихідне положення;
 • Виконати __2 штучних вдихи__ з використанням маски\-клапану до піднімання грудної клітки дитини;
 • Продовжити натискання і вдихи у співвідношенні __30:2 при проведенні СЛР однією особою або 15:2 при проведенні СЛР двома особами__; 
 • __Змінювати особу__, що проводить натискання на грудну клітку, __кожні 2 хвилини__;
"""


def main():
    # formatted_msg = format_message(msg)
    formatted_msg2 = format_message(msg2)
    print(formatted_msg2)


if __name__ == "__main__":
    main()
